{
  "kingsofnepal": {
    "prithvi_narayan_shah": {
      "id": "prithvi_narayan_shah",
      "title": "पृथ्वी नारायण शाह",
      "description": "पृथ्वी नारायण शाह, एकीकृत नेपालका पहिलो राजा, नेपाली इतिहासका सबैभन्दा महत्त्वपूर्ण व्यक्तित्व मानिन्छन्। उनी एक दूरदर्शी नेता थिए जसले विभिन्न साना राज्यहरू र राज्यहरूलाई एकल शासन अन्तर्गत एकीकृत गरी नेपाल राज्यको जग बसाले। उनको शासनभन्दा अघि, यो क्षेत्र साना-साना, प्रायः युद्धरत राज्यहरूमा विभाजित थियो, तर उनको सैन्य क्षमता, रणनीतिक गठबन्धन र नेतृत्व मार्फत पृथ्वी नारायण शाहले तिनीहरूलाई एकसाथ ल्याउन सफल भए। उनको शासनकालले शाह वंशको सुरुवात र नेपालको राजनीतिक संरचनाको आधारशिला राख्यो। उनलाई नेपालको एकीकरणकर्ता र शाह राजतन्त्रको संस्थापकको रूपमा सम्झिन्छ।",
      "reign_years": "वि.सं. १८०१-१८३१",
      "image": "/kings-of-nepal/01-king-pns.jpg"
    },
    "pratap_singh_shah": {
      "id": "pratap_singh_shah",
      "title": "प्रताप सिंह शाह",
      "description": "प्रताप सिंह शाह एकीकृत नेपालका दोस्रो राजा र पृथ्वी नारायण शाहका जेष्ठ पुत्र थिए। उनको शासनकाल भने छोटो थियो, जम्मा दुई वर्ष मात्र। प्रताप सिंह शाहले आफ्ना बुबाको मृत्युपछि गद्दी सम्हाले, तर उनको कम उमेरका कारण प्रशासन धेरैजसो उनका संरक्षकहरूको प्रभावमा थियो। प्रताप सिंहको शासन आन्तरिक द्वन्द्व र शक्तिका लागि संघर्षले छायाँकित थियो, र उनी १७७७ मा असामयिक निधन भएपछि उनको शासनकाल समाप्त भयो, त्यसपछि उनका भाइ, रण बहादुर शाह राजा भए। छोटो शासनकाल भए पनि, उनी नेपालका एकीकरणकर्ताका पुत्रको रूपमा नेपाली इतिहासमा महत्त्वपूर्ण व्यक्ति रहेका छन्।",
      "reign_years": "वि.सं. १८३१-१८३४",
      "image": "/kings-of-nepal/02-king-pss.jpg"
    },
    "rana_bahadur_shah": {
      "id": "rana_bahadur_shah",
      "title": "रण बहादुर शाह",
      "description": "रण बहादुर शाह कम उमेरमै सिंहासनमा बसे, र उनको शासनकाल अशान्ति र विवादले चिन्हित थियो। अस्थिर व्यक्तित्वका लागि चिनिने उनी बाल्यकालमै राजा बने र पछि संन्यासी बन्न १७९९ मा राजगद्दी त्याग गरे। उनको राजगद्दी त्याग र त्यससँग सम्बन्धित परिस्थितिहरू नेपाली इतिहासमा चासोको विषय रहेका छन्। उनको शासनकालमा राज्यले विभिन्न आन्तरिक शक्ति संघर्षहरू देख्यो, जसले अन्ततः उनलाई स्वेच्छाले सिंहासनबाट पछि हट्न लगायो। छोटो शासनकाल भए पनि, उनको जीवन र राजगद्दी त्यागले त्यसपछिका वर्षहरूमा नेपालको राजतन्त्र निर्माण गर्न महत्त्वपूर्ण भूमिका खेल्यो।",
      "reign_years": "वि.सं. १८३४-१८५५",
      "image": "/kings-of-nepal/03-king-rbs.jpg"
    },
    "girvan_yuddha_bikram_shah": {
      "id": "girvan_yuddha_bikram_shah",
      "title": "गिर्वाण युद्ध विक्रम शाह",
      "description": "गिर्वाण युद्ध विक्रम शाहको शासनकाल मूलतः आंग्ल-नेपाली युद्धको अवधिले परिभाषित थियो, जुन उनको सिंहासनमा रहेको समयमा भएको थियो। उनको नेतृत्वमा नेपालले आफ्नो क्षेत्रीय सीमा विस्तार गर्‍यो। ब्रिटिश ईस्ट इण्डिया कम्पनीसँगको युद्धले भने सुगौली सन्धिमा हस्ताक्षर गर्न लगायो, जसका कारण नेपालले ठूलो भूमि गुमायो। यी चुनौतीहरू बाबजुद, उनी नेपालको विस्तार र एकीकरणको अवधिमा एक महत्त्वपूर्ण राजा थिए। उनको शासनकालले नेपाली सैन्य इतिहास र क्षेत्रीय राजनीतिमा महत्त्वपूर्ण चरण चिन्हित गर्यो।",
      "reign_years": "वि.सं. १८५५-१९०३",
      "image": "/kings-of-nepal/04-king-gybs.jpg"
    },
    "rajendra_bikram_shah": {
      "id": "rajendra_bikram_shah",
      "title": "राजेन्द्र विक्रम शाह",
      "description": "राजेन्द्र विक्रम शाह शक्तिशाली राणा शासनको उदयको समयमा राजा थिए, जसले क्रमशः राजतन्त्रलाई एक औपचारिक पदमा घटायो। उनको शासनकाललाई शाह वंशको प्रत्यक्ष नियन्त्रणका अन्तिम वर्षहरू मानिन्छ, किनभने राणा परिवारले देशको प्रशासन हातमा लिए र वास्तविक शक्ति राखे। राजेन्द्रको शासनकालमा राजकीय अधिकारमा कमजोरी आयो, जसले राणाहरूका लागि वंशानुगत प्रधानमन्त्री पदको स्थापना गर्न लगायो। उनको शासनकालमा भएका परिवर्तनहरूले शाह राजतन्त्रको वास्तविक शासनको अन्त्य र राणा युगको सुरुवात चिन्हित गरे।",
      "reign_years": "वि.सं. १९०३-१९४२",
      "image": "/kings-of-nepal/05-king-rbs.jpg"
    },
    "surendra_bikram_shah": {
      "id": "surendra_bikram_shah",
      "title": "सुरेन्द्र विक्रम शाह",
      "description": "सुरेन्द्र विक्रम शाह राणा प्रधानमन्त्रीहरूको पूर्ण नियन्त्रणमा शासन गर्ने पहिलो राजा थिए। उनले राजाको उपाधि धारण गरे पनि, राणाहरू, विशेष गरी जंगबहादुर राणाले नेपालको शासनमाथि पूर्ण नियन्त्रण राखेका थिए। उनको शासनकालमा न्यूनतम राजकीय प्रभाव थियो, किनभने राणाहरूले आफ्नो राजनीतिक शक्ति एकीकृत गरे र राजतन्त्रलाई किनारा लगाए। राणा शासन, जुन एक शताब्दीभन्दा बढी समयसम्म चल्यो, प्रभावकारी रूपमा शाह राजतन्त्रलाई शक्तिहीन बनायो, र सुरेन्द्रको शासनकाल त्यस ऐतिहासिक अवधिको एक महत्त्वपूर्ण अध्याय थियो।",
      "reign_years": "वि.सं. १९४२-१९८४",
      "image": "/kings-of-nepal/06-king-sbs.jpg"
    },
    "prithvi_bir_bikram_shah": {
      "id": "prithvi_bir_bikram_shah",
      "title": "पृथ्वी वीर विक्रम शाह",
      "description": "पृथ्वी वीर विक्रम शाह एक आधुनिकीकरणकर्ता थिए जसले नेपालमा धेरै महत्त्वपूर्ण सुधारहरू ल्याए। उनको शासनकालमा देशमा पहिलो कलेज र अस्पताल स्थापना भए, जसले आधुनिकीकरणको अवधि चिन्हित गर्‍यो। नेपाललाई बाहिरी विश्वसँग सुधार र खोल्ने उनको प्रयास भए पनि, उनको शासनकाल राणा परिवारको प्रभुत्वले धब्बा लागेको थियो, जसले देशलाई नियन्त्रण गर्न जारी राख्यो। उनलाई नेपालको पूर्वाधार, शिक्षा र स्वास्थ्य प्रणालीलाई आधुनिकीकरण गर्ने प्रयासका लागि सम्झिन्छ, यद्यपि उनको शासनकाल त्यस समयको राजनीतिक वास्तविकताले सीमित थियो।",
      "reign_years": "वि.सं. १९८४-१९५६",
      "image": "/kings-of-nepal/07-king-pbbs.png"
    },
    "tribhuvan_bir_bikram_shah": {
      "id": "tribhuvan_bir_bikram_shah",
      "title": "त्रिभुवन वीर विक्रम शाह",
      "description": "त्रिभुवन वीर विक्रम शाहलाई राणा शासनको अन्त्यमा महत्त्वपूर्ण भूमिका खेलेकोमा चिनिन्छ। उनको शासनकालमा नेपालमा प्रजातन्त्रको स्थापना भयो, जुन राष्ट्रको इतिहासमा एक महत्त्वपूर्ण मोड थियो। भारतको समर्थनमा, उनी शताब्दी लामो राणा शासन अन्त्य गर्न र शाह राजतन्त्रको स्थिति पुनर्स्थापित गर्न सक्षम भए, यद्यपि राणा परिवारले १९५१ सम्म उल्लेखनीय प्रभाव कायम राखेका थिए। त्रिभुवनको नेतृत्व संवैधानिक राजतन्त्रको निर्माण र नेपाललाई प्रजातान्त्रिक सुधारहरूमा खोल्न महत्त्वपूर्ण थियो।",
      "reign_years": "वि.सं. १९५६-२००७",
      "image": "/kings-of-nepal/08-king-tbbs.png"
    },
    "gyanendra_bir_bikram_shah": {
      "id": "gyanendra_bir_bikram_shah",
      "title": "ज्ञानेन्द्र वीर विक्रम शाह",
      "description": "ज्ञानेन्द्र वीर विक्रम शाह नेपालका अन्तिम राजा थिए। उनको शासनकालले २००८ मा उन्मूलन हुनु अघिको राजतन्त्रको अन्तिम चरण चिन्हित गर्‍यो। ज्ञानेन्द्रका कार्यहरू, विशेष गरी संसद भंग गर्ने र शाही आदेशद्वारा शासन गर्ने उनको निर्णयले, राजतन्त्रको उन्मूलनलाई तीव्र बनायो। त्यस समयका राजनीतिक आन्दोलनहरूको दबाबमा, राजतन्त्र अन्ततः विघटन भयो, र नेपाल गणतन्त्र बन्यो। ज्ञानेन्द्रको शासनकाललाई प्रायः दुःखद शाही हत्याकाण्ड र राजतन्त्रको अन्तिम पतनका लागि सम्झिन्छ।",
      "reign_years": "वि.सं. २०५८-२०६५",
      "image": "/kings-of-nepal/13-king-gbbs.jpg"
    },
    "tribhuvan_bir_bikram_shah_restored": {
      "id": "tribhuvan_bir_bikram_shah_restored",
      "title": "त्रिभुवन वीर विक्रम शाह (पुनः)",
      "description": "त्रिभुवन वीर विक्रम शाहलाई राणा शासनको अन्त्यमा महत्त्वपूर्ण भूमिका खेलेकोमा चिनिन्छ। उनको शासनकालमा नेपालमा प्रजातन्त्रको स्थापना भयो, जुन राष्ट्रको इतिहासमा एक महत्त्वपूर्ण मोड थियो। भारतको समर्थनमा, उनी शताब्दी लामो राणा शासन अन्त्य गर्न र शाह राजतन्त्रको स्थिति पुनर्स्थापित गर्न सक्षम भए, यद्यपि राणा परिवारले १९५१ सम्म उल्लेखनीय प्रभाव कायम राखेका थिए। त्रिभुवनको नेतृत्व संवैधानिक राजतन्त्रको निर्माण र नेपाललाई प्रजातान्त्रिक सुधारहरूमा खोल्न महत्त्वपूर्ण थियो।",
      "reign_years": "वि.सं. २००८-२०११",
      "image": "/kings-of-nepal/08-king-tbbs.png"
    },
    "mahendra_bir_bikram_shah": {
      "id": "mahendra_bir_bikram_shah",
      "title": "महेन्द्र वीर विक्रम शाह",
      "description": "महेन्द्र वीर विक्रम शाहलाई पञ्चायत प्रणाली, एक पार्टीविहीन राजनीतिक प्रणाली, प्रस्तुत गर्न र नेपालमा धेरै ठूला पूर्वाधार परियोजनाहरू निरीक्षण गर्नका लागि चिनिन्छ। उनको शासनकालमा राजतन्त्रले राजनीतिमा आफ्नो भूमिका बलियो बनाएको देखियो, र उनले राजनीतिक प्रणालीमाथि पूर्ण नियन्त्रण लिएर शक्ति केन्द्रीकृत गरे। महेन्द्रको शासन देशलाई आधुनिकीकरण गर्ने प्रयासहरूले, तर साथै अधिनायकवाद र राजनीतिक विरोधको दमनले पनि चिन्हित थियो। उनको शासनकालले दशकौंसम्म नेपालको राजनीतिक परिदृश्यको आधारशिला राख्यो।",
      "reign_years": "वि.सं. २०११-२०२८",
      "image": "/kings-of-nepal/10-king-mbbs.jpg"
    },
    "birendra_bir_bikram_shah": {
      "id": "birendra_bir_bikram_shah",
      "title": "वीरेन्द्र वीर विक्रम शाह",
      "description": "वीरेन्द्र वीर विक्रम शाहले नेपालको निरंकुश राजतन्त्रबाट संवैधानिक राजतन्त्रमा संक्रमणमा महत्त्वपूर्ण भूमिका खेले। उनको शासनकालमा प्रजातान्त्रिक सुधारहरू र संसदीय चुनावहरूको अनुमति दिने नयाँ संविधानको अपनाउने कार्य भयो। वीरेन्द्रलाई नेपाललाई प्रजातान्त्रिक बनाउन र अन्तर्राष्ट्रिय समुदायसँग सम्बन्ध सुधार गर्न उनको प्रतिबद्धताका लागि सम्झिन्छ। उनको शासनकाल उल्लेखनीय सामाजिक र राजनीतिक परिवर्तनको अवधि थियो, जसले अधिक खुला र प्रजातान्त्रिक समाजको लागि आधार तयार गर्‍यो।",
      "reign_years": "वि.सं. २०२८-२०५८",
      "image": "/kings-of-nepal/11-king-bbs.jpg"
    },
    "dipendra_bir_bikram_shah": {
      "id": "dipendra_bir_bikram_shah",
      "title": "दीपेन्द्र वीर विक्रम शाह",
      "description": "दीपेन्द्र वीर विक्रम शाहको नेपाली इतिहासमा सबैभन्दा छोटो शासनकाल थियो, कोमामा रहँदा मात्र तीन दिनको। उनी नेपालको शाही परिवारमा एक दुखद घटनाका लागि जिम्मेवार थिए जब उनले सिंहासनसम्बन्धी विवादमा आफ्ना परिवारका सदस्यहरूलाई मारेको खबर थियो, आफैलाई गोली हानेर घाइते हुनु अघि। उनको छोटो र दुखद शासनकालले नेपालको राजतन्त्रमा अमिट छाप छोड्यो, किनभने त्यसपछि तुरुन्तै उनका बुबा, ज्ञानेन्द्रको उत्तराधिकार भयो।",
      "reign_years": "वि.सं. २०५८",
      "image": "/kings-of-nepal/12-king-dbbs.jpg"
    }
  }
}